// 1. Ստեղծել ֆունկցիա, որը ստանալով 2 թիվ տպում այդ թվերի միջև եղած բոլոր թվերը: Օրինակ foo(40,50) տպել 40-50 բոլոր թվերը

// function nums(n1,n2){
//     for(let i = n1; i <= n2; i++){
//         console.log(i);
//     }
// }

// nums(40,50)

// 2. Ստեղծել ֆունկցիա, որը ստանալով 2 թիվ տպում է առաջին թիը 2-րդ թվով տրված տոկոսը օրինակ fօօ(60,50) => 30

// function foo(n1,n2){
//     return (n1 * n2) / 100
// }

// console.log(foo(60,50));

// 3. Տրված են 2 փոփոխականներ՝ n և m (n < m): Գրել ֆունկցիա, որը կտպի տրված թվերի միջակայքում գտնվող 2-ի աստիճան թվերը՝

function foo(n, m){
    for(let i = 2; i <= m; i *= 2 ){
        i >= n ? console.log(i): null;
    }
}

foo(100, 1000)

// 4. Ստեղծել ֆունկցիա, որը ստանալով 1 կոտորակային թիվ տպում է առաջին թիվը 100-ական Ճշտությամբ: Օրինակ foo(3.2324) => 3.23

function cloracum(num){
    
}

// 5. Կոնսոլում աստղանիշների միջոցով տպել բուրգ, օգտագործելով ցիկլ
// օրինակ 

// *
// **
// ***
// ****
// *****

//     *
//    **
//   ***
//  ****
// *****


//     *
//    ***
//   *****
//  *******
// *********